name: "SR"
layer {
  name: "LRinput"
  type: "Data"
  top: "lowdata"
  include {
    phase: TRAIN
  }
  transform_param {
    scale:0.00390625
  }
  data_param {  
    source: "examples/SuperResolution/SR_data/SR_trainLR_lmdb"
    batch_size: 789
    backend: LMDB
  }
}
layer {
  name: "HRinput"
  type: "Data"
  top: "highdata"
  include {
    phase: TRAIN
  }
  transform_param {
    scale:0.00390625
  }
  data_param {
    source: "examples/SuperResolution/SR_data/SR_trainSR_lmdb"
    batch_size: 789
    backend: LMDB
  }
}

layer {
  name: "LRinput"
  type: "Data"
  top: "lowdata"
  include {
    phase: TEST
  }
  transform_param {
    scale:0.00390625
  }
  data_param {
    source: "examples/SuperResolution/SR_data/SR_testLR_lmdb"
    batch_size: 622
    backend: LMDB
  }
}
layer {
  name: "HRinput"
  type: "Data"
  top: "highdata"
  include {
    phase: TEST
  }
  transform_param {
    scale:0.00390625
  }
  data_param {
    source: "examples/SuperResolution/SR_data/SR_testSR_lmdb"
    batch_size: 622
    backend: LMDB
  }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "lowdata"
  top: "conv1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 64
    kernel_size: 9
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "conv1"
  top: "conv2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "conv2"
  top: "conv3"
  param {
    lr_mult: 0.1
  }
  param {
    lr_mult: 0.2
  }
  convolution_param {
    num_output: 1
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "mse"
  type: "EuclideanLoss"
  bottom: "highdata"
  bottom: "conv3"
  top: "loss"
}
